Bootcamp/Week6/day1/video-games-tournament/app/controllers/tournaments_controller.rb

SELECT "tournaments".* FROM "tournaments"
---
  def index
    @tournaments = Tournament.all

SELECT "tournaments".* FROM "tournaments"
---
  def show
    @tournaments = Tournament.all

INSERT INTO "tournaments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Bacon Eating Championship"], ["created_at", "2016-11-21 13:04:12.251745"], ["updated_at", "2016-11-21 13:04:12.251745"]]
---
  def create
    @tournament = Tournament.create(tournament_params)

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "tournaments" WHERE "tournaments"."id" = ?  [["id", 1]]
---
  def destroy
    @tournament = Tournament.find_by(id: params[:id])
    unless @tournament
      render json: {error: "tournament not found"},
        status: 404
      return
    end
    @tournament.destroy